In [101]:
%matplotlib inline
import pandas as pd

In [102]:
import os

In [103]:
os.getcwd()

'C:\\Users\\nandeesh\\Downloads'

In [104]:
titles = pd.read_csv('titles.csv')
titles

                                      title  year
0                        Tasveer Mere Sanam  1996
1                                  Only You  1994
2                      El pueblo del terror  1970
3                                   Machine  2007
4                                      MARy  2008
...                                     ...   ...
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

[244914 rows x 2 columns]

### How many movies are listed in the titles dataframe?

In [105]:
titles.shape

(244914, 2)

In [106]:
titles.count()

title    244914
year     244914
dtype: int64

### What are the earliest two films listed in the titles dataframe?

In [107]:
titles.head(2)

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

### How many movies have the title "Hamlet"?

In [108]:
titles1=titles[titles["title"]=="Hamlet"]
titles1

         title  year
6422    Hamlet  2017
10637   Hamlet  1921
39916   Hamlet  1913
52521   Hamlet  1910
62000   Hamlet  2000
67406   Hamlet  1969
82130   Hamlet  1987
88065   Hamlet  2016
101728  Hamlet  1948
122827  Hamlet  1973
133921  Hamlet  1976
154029  Hamlet  2015
161324  Hamlet  1964
172640  Hamlet  1954
173033  Hamlet  2011
178222  Hamlet  1996
189093  Hamlet  2009
192142  Hamlet  1990
198234  Hamlet  1911
202025  Hamlet  2014

In [109]:
titles1.count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [110]:
titles2=titles[titles["title"]=="North by Northwest"]
titles2

                    title  year
74398  North by Northwest  1959

In [111]:
titles2.count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [112]:
titles[titles['title'].str.contains("Hamlet")].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [113]:
titles3=titles[titles['title'].str.contains("Treasure Island")].sort_values('year')
titles3

                                                    title  year
55686                                     Treasure Island  1918
196514                                    Treasure Island  1920
141822                                    Treasure Island  1934
64173                       The Secret of Treasure Island  1938
79701                     Charlie Chan at Treasure Island  1939
77354                                     Treasure Island  1950
34341                           Return to Treasure Island  1954
34288                           Five on a Treasure Island  1957
65051                                     Treasure Island  1972
37238                                     Treasure Island  1973
173051                                    Treasure Island  1985
26111                              Muppet Treasure Island  1996
27076                                     Treasure Island  1999
216970                               Treasure Island (II)  1999
209707  Treasure Island Kids: The Battle of Treasure I...  2006
2830                           Pirates of Treasure Island  2006
112591  Treasure Island Kids: The Mystery of Treasure ...  2006
244541  Treasure Island Kids: The Monster of Treasure ...  2006
155317             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

In [114]:
titles4=titles[titles['year']==1950]
print(titles4['year'].shape,"this many movies were made in the year 1950")

(1113,) this many movies were made in the year 1950

### How many movies were made in the year 1960?

In [115]:
titles4=titles[titles['year']==1960]
print(titles4['year'].count(),"this many movies were made in the year 1960")

1549 this many movies were made in the year 1960

### How many movies were made from 1950 through 1959?

In [116]:
titles4=titles[(titles['year']>1950) & (titles['year']<1959)]
print(titles4['year'].count(),"this many movies were made from 1950 to 1959")

10306 this many movies were made from 1950 to 1959

### In what years has a movie titled "Batman" been released?

In [117]:
titles[titles['title'].str.contains("Batman")].sort_values('year').head(35)

                                              title  year
39349                                        Batman  1943
204905                             Batman and Robin  1949
93271                                Batman Dracula  1964
34251                         Alyas Batman at Robin  1965
180265                                 James Batman  1966
134007                            Batman: The Movie  1966
170948                        Batman Fights Dracula  1967
91440                         Fight! Batman, Fight!  1973
240896                                       Batman  1989
183764                        Alyas Batman en Robin  1991
21158                                Batman Returns  1992
92106                  Batman: Mask of the Phantasm  1993
163887                               Batman Forever  1995
153828                               Batman & Robin  1997
223791                                Batman Begins  2005
3609                                 Batman Reboots  2010
78155                     Batman: The Final Victory  2010
49259                                 Batman Untold  2010
161608                              Batman Revealed  2012
139039                             Batman: Crusader  2014
143064                 Batman Beyond: Rising Knight  2014
56896            Batman v Superman: Dawn of Justice  2016
29920                               Batman: Anarchy  2016
192806           B@: It's a Wonderful Life, Batman!  2016
42483                      Batman: The Killing Joke  2016
130474        Batman: Return of the Caped Crusaders  2016
93833                       B@ (Batman Parody Film)  2016
230776                       Batman: Master of Fear  2017
213182                Batman the Dawn of the Knight  2017
26577                         The LEGO Batman Movie  2017
63068              Batman V Superman: League at War  2018
161657                  Batman the Rise of Red Hood  2018
194288  Scooby-Doo & Batman: the Brave and the Bold  2018
108277                                 Batman Ninja  2018
127552                              Batman Unveiled  2018

### How many roles were there in the movie "Inception"?

In [129]:
cast1 = pd.read_csv('cast.csv')
cast1

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3786171,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3786172,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3786173,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3786174,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3786175,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

In [130]:
cast2=cast1[cast1['title']=="Inception"]
cast2

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3387147,Inception,2010,Ellen Page,actress,Ariadne,3.0
3444628,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3473041,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3480170,Inception,2010,Talulah Riley,actress,Blonde,25.0
3731263,Inception,2010,Shannon Welles,actress,Old Mal,51.0

In [132]:
print(len(cast2['character']),"these many roles were there in Inception")

78 these many roles were there in Inception

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [133]:
cast3=cast2[cast2["title"]=="Inception"]
cast3.isna().sum()

title         0
year          0
name          0
type          0
character     0
n            27
dtype: int64

In [134]:
print("27 roles in the movie Inception are not ranked by an 'n ' value")

27 roles in the movie Inception are not ranked by an 'n ' value

### But how many roles in the movie "Inception" did receive an "n" value?

In [141]:
cast3=cast2.dropna()
cast4=cast3[cast3["title"]=="Inception"]
cast4.head()

            title  year            name   type              character     n
149008  Inception  2010    Peter Basham  actor  Fischer's Jet Captain  44.0
183937  Inception  2010    Tom Berenger  actor               Browning   8.0
260128  Inception  2010  Virgile Bramly  actor         Bridge Sub Con  29.0
326745  Inception  2010   Michael Caine  actor                  Miles  11.0
333415  Inception  2010    Earl Cameron  actor       Elderly Bald Man  20.0

In [142]:
print(len(cast4),"roles in the movie Inception did receive an n value ")

51 roles in the movie Inception did receive an n value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [151]:
cast2=cast1.dropna()
cast3=cast2[cast2["title"]=="North by Northwest"].sort_values('n')
cast3

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [155]:
cast2=cast1.dropna()
cast3=cast2[cast2["title"]=="Sleuth"].sort_values('n').sort_values("year")
cast3[cast3["year"]==1972]

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [157]:
cast2=cast1.dropna()
cast3=cast2[cast2["title"]=="Sleuth"].sort_values('n').sort_values("year")
cast3[cast3["year"]==2007]

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [247]:
cast2=cast1[(cast1.title=='Hamlet') & (cast1.year==1921)]
cast2

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [248]:
print(len(cast2),"roles were credited in the silent 1921 version of Hamlet")

9 roles were credited in the silent 1921 version of Hamlet

# How many roles were credited in Branagh’s 1996 Hamlet?

In [250]:
cast2=cast1[(cast1.title=='Hamlet') & (cast1.year==1996)]
cast4=cast2[cast2.title=='Branagh']
cast4

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

In [249]:
print(len(cast4),"roles were credited in Branagh’s 1996 Hamlet")

0 roles were credited in Branagh’s 1996 Hamlet

### How many "Hamlet" roles have been listed in all film credits through history?

In [251]:
print(len(cast1.title=='Hamlet'),"Hamlet roles have been listed in all film credits through history")

3786176 Hamlet roles have been listed in all film credits through history

### How many people have played an "Ophelia"?

In [162]:
cast2=cast1[cast1.character=="Ophelia"]
cast2

,title,year,name,type,character,n
248251,The Merry Maids of Madness,2016,Amy Bourque,actor,Ophelia,11.0
410247,Jake Gets Paid,2009,Josie Chisholm,actor,Ophelia,NaN
470859,Inoperable,2017,Crystal Cordero,actor,Ophelia,NaN
866334,"Dogg's Hamlet, Cahoot's Macbeth",2005,Lucas Grabeel,actor,Ophelia,NaN
1364457,11,2014,Catherine (IV) Lord,actor,Ophelia,NaN
...,...,...,...,...,...,...
3722298,D.C. Cab,1983,Marsha Warfield,actress,Ophelia,7.0
3723039,Creature,2011,Jennifer Lynn Warren,actress,Ophelia,12.0
3733637,Hamlet,2015,Katie (II) West,actress,Ophelia,7.0
3748118,National Theatre Live: Rosencrantz & Guildenst...,2017,Helen (IV) Wilson,actress,Ophelia,NaN
3751232,Hamlet,1996,Kate Winslet,actress,Ophelia,46.0

In [163]:
print(len(cast2),"people have played an Ophelia")

117 people have played an Ophelia

### How many people have played a role called "The Dude"?

In [167]:
cast2=cast1[cast1.character=="The Dude"]
cast2

,title,year,name,type,character,n
272161,The Big Lebowski,1998,Jeff Bridges,actor,The Dude,1.0
339389,Terms & Conditions,2015,Jordan Cann,actor,The Dude,9.0
498660,Stranger,2000,Scott Crowell,actor,The Dude,NaN
570128,Pizza Man vs. the Dude,2004,Chris DeMarcus,actor,The Dude,NaN
610791,Sweepstakes,1931,Mike Donlin,actor,The Dude,12.0
629473,Self Helpless,2010,Devin The Dude,actor,The Dude,NaN
855976,A Few Brains More,2012,Michael D. Goodwin,actor,The Dude,NaN
1089444,Jay and Silent Bob Strike Back,2001,Matthew (XIX) James,actor,The Dude,37.0
1138933,Explicit Ills,2008,Christopher Kadish,actor,The Dude,27.0
1367230,American Idiots,2013,Jason Loughridge,actor,The Dude,10.0
1386561,The Winds of Autumn,1976,Steve Lyons,actor,The Dude,30.0
1512572,The Liq,2016,Mark Alan Meek,actor,The Dude,NaN
1540933,Wild Oats Lane,1926,Jerry Miley,actor,The Dude,6.0
1784519,Oklahoma Badlands,1948,House Peters Jr.,actor,The Dude,13.0
1824744,Cloud Air: The Movie,2013,Thomas (VIII) Porter,actor,The Dude,8.0
1838960,Hacks,1997,Jason Priestley,actor,The Dude,11.0
2202150,Carlos Spills the Beans,2013,Bobby Styles,actor,The Dude,NaN
2336261,Zachariah,1971,Dick Van Patten,actor,The Dude,9.0
2419271,It Can Be Arranged,2010,Joel Weiss,actor,The Dude,NaN

In [168]:
print(len(cast2),"people have played a role called The Dude")

19 people have played a role called The Dude

### How many people have played a role called "The Stranger"?

In [169]:
cast2=cast1[cast1.character=="The Stranger"]
cast2

,title,year,name,type,character,n
25954,Theeb,2014,Hassan Mutlag Al-Maraiyeh,actor,The Stranger,2.0
35748,My Time to Die,2014,Vincent H. Alexander,actor,The Stranger,2.0
46418,Hickok,2017,Terral Altom,actor,The Stranger,NaN
67421,Get Mean,1975,Tony Anthony,actor,The Stranger,1.0
67424,Lo straniero di silenzio,1968,Tony Anthony,actor,The Stranger,1.0
...,...,...,...,...,...,...
3219011,Ever Since Eve,1921,Ethel Lynne,actress,The Stranger,7.0
3405700,Weitertanzen,2008,Rosa Maria Paz,actress,The Stranger,NaN
3427715,The Godsend,1980,Angela Pleasence,actress,The Stranger,3.0
3567516,Motherland,1927,Dorinea Shirley,actress,The Stranger,NaN
3746949,The Seventh,2017,Kerry (II) Willison-Parry,actress,The Stranger,NaN

In [170]:
print(len(cast2),"people have played a role called The Stranger")

212 people have played a role called The Stranger

### How many roles has Sidney Poitier played throughout his career?

In [179]:
cast2=cast1[cast1.name=="Sidney Poitier"]
cast2.head()

,title,year,name,type,character,n
1816209,A Patch of Blue,1965,Sidney Poitier,actor,Gordon Ralfe,1.0
1816210,A Piece of the Action,1977,Sidney Poitier,actor,Manny Durrell,1.0
1816211,A Raisin in the Sun,1961,Sidney Poitier,actor,Walter Lee Younger,1.0
1816212,A Warm December,1973,Sidney Poitier,actor,Dr. Matt Younger,1.0
1816213,All the Young Men,1960,Sidney Poitier,actor,Sgt. Eddie Towler,2.0

In [180]:
print(len(cast2),"roles played bt Sidney Poitier")

43 roles played bt Sidney Poitier

### How many roles has Judi Dench played?

In [181]:
cast2=cast1[cast1.name=="Judi Dench"]
cast2.head()

,title,year,name,type,character,n
2814206,84 Charing Cross Road,1987,Judi Dench,actress,Nora Doel,3.0
2814207,A Handful of Dust,1988,Judi Dench,actress,Mrs. Beaver,13.0
2814208,A Midsummer Night's Dream,1968,Judi Dench,actress,Titania,16.0
2814209,A Room with a View,1985,Judi Dench,actress,"Eleanor Lavish, a novelist",7.0
2814210,A Study in Terror,1965,Judi Dench,actress,Sally,8.0

In [182]:
print(len(cast2),"roles played by Judi dench")

55 roles played by Judi dench

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [188]:
cast6=cast1[(cast1.name=="Cary Grant")&(cast1.year==1940)]
cast6[cast6.n==2]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [189]:
cast6=cast1[(cast1.name=="Cary Grant")&(cast1.year==1940)]
cast6

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [227]:
cast6=cast1[(cast1.year==1950)&(cast1.type=="actor")]
cast6.count()

title        16760
year         16760
name         16760
type         16760
character    16760
n             7649
dtype: int64

In [229]:
print(  "7649 roles were available for actors in the 1950s")

7649 roles were available for actors in the 1950s

### How many roles were available for actresses in the 1950s?

In [230]:
cast6=cast1[(cast1.year==1950)&(cast1.type=="actress")]
cast6.count()

title        5637
year         5637
name         5637
type         5637
character    5637
n            3204
dtype: int64

In [232]:
print("3204 roles were available for actress in the 1950s")

3204 roles were available for actress in the 1950s

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [233]:
cast6=cast1[(cast1.year==1980)&(cast1.n==1)]
cast6.head()

,title,year,name,type,character,n
1293,Il pap'occhio,1980,Diego Abatantuono,actor,Padre Gabriele,1.0
1452,Athkiya' laken aghbiya',1980,Rushdy Abaza,actor,Hamdi,1.0
2543,El Banat Ayza Eih,1980,Mahmoud Abdel Aziz,actor,Kamal,1.0
2558,X Ma'anah Alamt Khata,1980,Mahmoud Abdel Aziz,actor,Ramzy,1.0
2971,Airplane!,1980,Kareem Abdul-Jabbar,actor,Roger Murdock,1.0

In [234]:
cast6.count()

title        1183
year         1183
name         1183
type         1183
character    1183
n            1183
dtype: int64

In [235]:
print(len(cast6),"leading roles (n=1) were available from the beginning of film history through 1980")

1183 leading roles (n=1) were available from the beginning of film history through 1980

### How many non-leading roles were available through from the beginning of film history through 1980?

In [236]:
cast6=cast1[cast1.year==1980]
cast6.head()

,title,year,name,type,character,n
197,Cheech and Chong's Next Movie,1980,Bobby A.,actor,Doorman,33.0
459,Aurinkotuuli,1980,Jouko Aaltonen,actor,Man on lecture,12.0
509,Bob Hope's All-Star Look at TV's Prime Time Wars,1980,Willie Aames,actor,Himself,NaN
641,Raging Bull,1980,Bob Aaron,actor,Prison Guard #1,86.0
1264,Arrivano i gatti,1980,Diego Abatantuono,actor,Felice,10.0

In [238]:
cast6.count()

title        23472
year         23472
name         23472
type         23472
character    23472
n            19006
dtype: int64

In [239]:
print("19006 non-leading roles were available through from the beginning of film history through 1980")

19006 non-leading roles were available through from the beginning of film history through 1980

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [242]:
cast6=cast1[cast1.year==1980]
cast6.head()

,title,year,name,type,character,n
197,Cheech and Chong's Next Movie,1980,Bobby A.,actor,Doorman,33.0
459,Aurinkotuuli,1980,Jouko Aaltonen,actor,Man on lecture,12.0
509,Bob Hope's All-Star Look at TV's Prime Time Wars,1980,Willie Aames,actor,Himself,NaN
641,Raging Bull,1980,Bob Aaron,actor,Prison Guard #1,86.0
1264,Arrivano i gatti,1980,Diego Abatantuono,actor,Felice,10.0

In [243]:
cast6.count()

title        23472
year         23472
name         23472
type         23472
character    23472
n            19006
dtype: int64

In [246]:
len(cast6[cast6['n']=='NaN'].isnull().sum())

C:\Users\nandeesh\anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

6